from pprint import pprint
shoping_list = ["хлеб", "молоко", "яйца", "ветчина", "помидоры"]
# привел пример списка списком покупок

recipe = ("Ром белый 50мл", "Лимонный сок 25мл", "Сахарный сироп 25мл")
# рецепт класического коктейля Дайкири

waiter = ["Анастасия Коновко", "Кукушкина Катя", "Тихонов Артем", "Моложенко Валерия"]
barmens = ["Яншин Алексей", "Даниленко Данил", "Тихонов Артем"]
personal = set(waiter).union(set(barmens))
# создал множество из списка перснонала

whiskey = ["Джемесон", "Джек Даниелс", "Балантайс", "Файмос Граус", "Макаллан"]
rum = ["Бакарди", "Гавана Клаб", "Капитан Морган"]
cognac = ["Хенеси", "Реми Мартин", "Мартель"]
vodka = ["Русский Стандарт", "Белая Березка", "Абсолют", "Белуга"]
menu = {"Виски": whiskey, "Ром": rum, "Коньяк": cognac, "Водка": vodka}
# словарь как меню ресторана
print(shoping_list, recipe, personal, menu)
print(type(shoping_list), type(recipe), type(personal), type(menu))